Revit 2027 API
ConductorMaterial.GetConductorMaterialIdByName Method
 Gets the Conductor Material id by given Conductor Material name.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetConductorMaterialIdByName(
	Document document,
	string name
)
Public Shared Function GetConductorMaterialIdByName (
	document As Document,
	name As String
) As ElementId
public:
static ElementId^ GetConductorMaterialIdByName(
	Document^ document,
	String^ name
)
static member GetConductorMaterialIdByName :
        document : Document *
        name : string -> ElementId
Parameters
document Document
 The document.
name String
 The Conductor Material name.
Return Value
ElementId
 The Conductor Material id.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
ConductorMaterial Class
Autodesk.Revit.DB.Electrical Namespace